# SQLite

In [2]:
import sqlite3

In [4]:
db=sqlite3.connect("C:/Users/Bank of America/Data Science/SQLite/student_database.db")

In [5]:
cur=db.cursor()

In [6]:
cur.execute('create table student (id int primary key,name text, section text, marks int)')

In [8]:
cur.execute("insert into student (id,name,section,marks) values (1,'Mohit','A',65)")

In [9]:
db.commit

In [10]:
print(cur.rowcount)

1

In [13]:
cur.execute("insert into student (id,name,section,marks) values (2,'Swati','B',70)")

In [14]:
cur.execute("insert into student (id,name,section,marks) values (3,'Monika','C',75)")

In [18]:
cur.rowcount

1

In [19]:
db.commit

In [21]:
print(cur.rowcount)

1

In [28]:
result=cur.execute("select * from student")

In [29]:
for row in result:
    print(row)

(1, 'Mohit', 'A', 65)
(2, 'Swati', 'B', 70)
(3, 'Monika', 'C', 75)

In [34]:
for row in (cur.execute("select * from student")):
    print(row)

(1, 'Mohit', 'A', 65)
(2, 'Swati', 'B', 70)
(3, 'Monika', 'C', 75)
(4, 'Rakesh', 'C', 90)
(5, 'Ajay', 'A', 89)

In [35]:
print(cur.rowcount)

-1

In [31]:
# Next Class

In [32]:
cur.execute("insert into student values (4,'Rakesh','C',90)")

In [33]:
cur.execute("insert into student values (5,'Ajay','A',89)")

In [36]:
cur.execute("create table employee(id int,name text,age int)")

In [37]:
for row in (cur.execute("select * from student")):
    print(row)

(1, 'Mohit', 'A', 65)
(2, 'Swati', 'B', 70)
(3, 'Monika', 'C', 75)
(4, 'Rakesh', 'C', 90)
(5, 'Ajay', 'A', 89)

In [38]:
for row in (cur.execute("select id,name from student")):
    print(row)

(1, 'Mohit')
(2, 'Swati')
(3, 'Monika')
(4, 'Rakesh')
(5, 'Ajay')

In [39]:
for row in (cur.execute("select id,marks from student")):
    print(row)

(1, 65)
(2, 70)
(3, 75)
(4, 90)
(5, 89)

In [41]:
for row in (cur.execute("select * from student where id=2")):
    print(row)

(2, 'Swati', 'B', 70)

In [75]:
for row in (cur.execute("select * from student order by name desc")):
    print(row)

(2, 'Swati', 'B', 70)
(4, 'Rakesh', 'C', 90)
(3, 'Monika', 'C', 75)
(1, 'Mohit', 'A', 65)
(5, 'Ajay', 'A', 89)

In [46]:
for row in (cur.execute("select * from student limit 2")):
    print(row)

(1, 'Mohit', 'A', 65)
(2, 'Swati', 'B', 70)

In [54]:
for row in (cur.execute("select * from student where name='Mohit'")):
    print(row)

(1, 'Mohit', 'A', 65)

In [60]:
for row in (cur.execute("select * from student where marks<99 and marks>85")):
    print(row)

(4, 'Rakesh', 'C', 90)
(5, 'Ajay', 'A', 89)

In [61]:
for row in (cur.execute("select * from student where id <4 and id>2")):
    print(row)

(3, 'Monika', 'C', 75)

In [66]:
for row in (cur.execute("select marks from student where name ='Swati'")):
    print(row)

(70,)

In [70]:
for row in (cur.execute("select * from student where id=3 or marks=90")):
    print(row)

(3, 'Monika', 'C', 75)
(4, 'Rakesh', 'C', 90)

In [ ]:
for row in (cur.execute("select * from student")):
    print(row)

In [77]:
# fetchall wl display all rows

results= cur.execute('select * from student')
results.fetchall()

[(1, 'Mohit', 'A', 65),
 (2, 'Swati', 'B', 70),
 (3, 'Monika', 'C', 75),
 (4, 'Rakesh', 'C', 90),
 (5, 'Ajay', 'A', 89)]

In [79]:
for row in (cur.execute("select * from student where marks is not null")):
    print(row)

(1, 'Mohit', 'A', 65)
(2, 'Swati', 'B', 70)
(3, 'Monika', 'C', 75)
(4, 'Rakesh', 'C', 90)
(5, 'Ajay', 'A', 89)

In [80]:
for row in (cur.execute("select * from student where name like 'M%'")):
    print(row)

(1, 'Mohit', 'A', 65)
(3, 'Monika', 'C', 75)

In [81]:
for row in (cur.execute("select min(marks) from student")):
    print(row)

(65,)

In [82]:
for row in (cur.execute("select max(marks) from student")):
    print(row)

(90,)

In [83]:
for row in (cur.execute("select avg(marks) from student")):
    print(row)

(77.8,)

In [84]:
for row in (cur.execute("select sum(marks) from student")):
    print(row)

(389,)

In [88]:
for row in (cur.execute("select count() from student")):
    print(row)

(5,)

In [89]:
for row in (cur.execute("select min(id,marks) from student")):
    print(row)

(1,)
(2,)
(3,)
(4,)
(5,)

In [91]:
results=cur.execute("select count() from student")
results.fetchall()

[(5,)]

In [92]:
for row in (cur.execute("select * from student where marks between 80 and 90")):
    print(row)

(4, 'Rakesh', 'C', 90)
(5, 'Ajay', 'A', 89)

In [94]:
for row in (cur.execute("select * from student where name like '___t%'")):
    print(row)

(2, 'Swati', 'B', 70)

In [95]:
for row in (cur.execute("select * from student where name like '_____'")):
    print(row)

(1, 'Mohit', 'A', 65)
(2, 'Swati', 'B', 70)

In [98]:
for row in (cur.execute("select * from student where marks not in (90)")):
    print(row)

(1, 'Mohit', 'A', 65)
(2, 'Swati', 'B', 70)
(3, 'Monika', 'C', 75)
(5, 'Ajay', 'A', 89)

In [99]:
for row in (cur.execute("select * from student where name not in ('Mohit')")):
    print(row)

(2, 'Swati', 'B', 70)
(3, 'Monika', 'C', 75)
(4, 'Rakesh', 'C', 90)
(5, 'Ajay', 'A', 89)

# Update records

In [100]:
for row in (cur.execute("update student set marks=95 where name='Rakesh'")):
    print(row)

In [101]:
for row in (cur.execute("select * from student")):
    print(row)

(1, 'Mohit', 'A', 65)
(2, 'Swati', 'B', 70)
(3, 'Monika', 'C', 75)
(4, 'Rakesh', 'C', 95)
(5, 'Ajay', 'A', 89)

In [110]:
# Multiple updation

cur.execute("update student set marks=88 where id in (1,3)")

In [111]:
for row in (cur.execute("select * from student")):
    print(row)

(1, 'Mohit', 'A', 88)
(2, 'Swati', 'B', 70)
(3, 'Monika', 'C', 88)
(4, 'Rakesh', 'C', 95)
(5, 'Ajay', 'A', 89)

In [112]:
# Delete the record

In [113]:
cur.execute("delete from student where id=4")

In [114]:
for row in (cur.execute("select * from student")):
    print(row)

(1, 'Mohit', 'A', 88)
(2, 'Swati', 'B', 70)
(3, 'Monika', 'C', 88)
(5, 'Ajay', 'A', 89)

In [115]:
cur.execute("select * from student").fetchall()

[(1, 'Mohit', 'A', 88),
 (2, 'Swati', 'B', 70),
 (3, 'Monika', 'C', 88),
 (5, 'Ajay', 'A', 89)]

In [116]:
# delete table

drop table student

SyntaxError: invalid syntax (<ipython-input-116-39c4b833e3a2>, line 3)

In [1]:
# Take data from .csv file

In [3]:
import sqlite3

In [4]:
db=sqlite3.connect("student_database.db")

In [5]:
cur=db.cursor()

In [6]:
cur.execute('create table score (id int primary key, name text,marks int)')

In [8]:
cur.execute('insert into score (id,name,marks) values (0,"Name",00)')

In [9]:
db.commit()    # to save data

In [10]:
print(cur.rowcount)

1

# now, open .csv file and copy data into db

In [13]:
with open('data.csv','r') as file:
    total_records=0
    for row in file:
        cur.execute('insert into score values (?,?,?)',row.split(","))
        db.commit()
        total_records +=1

In [14]:
print(total_records)

8

In [15]:
result=cur.execute('select * from score')
result.fetchall()

[(0, 'Name', 0),
 (1, 'John', 90),
 (2, 'Jack', 80),
 (3, 'lisa', 60),
 (4, 'mohit', 30),
 (5, 'ajay', 50),
 (6, 'swati', 25),
 (7, 'rakesh', 40),
 (8, 'monika', 20)]

In [16]:
# perform some simple operatiopns

In [19]:
result=cur.execute('select * from score where marks <50')
result.fetchall()

[(0, 'Name', 0),
 (4, 'mohit', 30),
 (6, 'swati', 25),
 (7, 'rakesh', 40),
 (8, 'monika', 20)]

In [20]:
result=cur.execute('select avg(marks) from score')
result.fetchall()

[(43.888888888888886,)]

# SQLITE with python

In [21]:
import sqlite3

In [22]:
db=sqlite3.connect('student_database.db')

In [24]:
def sql_table(db):
    cur=db.cursor()
    cur.execute('create table employee(id int primary key,name text,salary real,department text,position text,hiredate date)')
    db.commit()

In [26]:
# call function to create table in a existing database

sql_table(db)

In [29]:
# input manual data first
cur=db.cursor()
cur.execute('insert into employee values(1,"jack",9000,"HR","Manager",2019-07-09)')

In [30]:
db.commit()

In [31]:
print(cur.rowcount)

1

In [33]:
result=cur.execute('select * from employee')
result.fetchall()

[(1, 'jack', 9000.0, 'HR', 'Manager', 2003)]

In [35]:
# create function to input entities

def sql_insert(db,entities):
    cur=db.cursor()
    cur.execute('insert into employee values (?,?,?,?,?,?)',entities)

In [36]:
entities=(2,"Andrew",7000,"IT","Engineer","2015-04-06")

sql_insert(db,entities)

In [37]:
result=cur.execute('select * from employee')
result.fetchall()

[(1, 'jack', 9000.0, 'HR', 'Manager', 2003),
 (2, 'Andrew', 7000.0, 'IT', 'Engineer', '2015-04-06')]

In [38]:
#  3rd entry

entities=(3,"Thomas",6000,"HR","Manager","2016-06-14")

sql_insert(db,entities)

In [39]:
# 4th entry

entities=(4,"Rudolf",8000,"IT","Engineer","2012-08-23")

sql_insert(db,entities)

In [40]:
#5th entry

entities=(5,"Suzen",10000,"Sales","Sales executive","2018-02-19")

sql_insert(db,entities)

In [41]:
result=cur.execute('select * from employee')
result.fetchall()

[(1, 'jack', 9000.0, 'HR', 'Manager', 2003),
 (2, 'Andrew', 7000.0, 'IT', 'Engineer', '2015-04-06'),
 (3, 'Thomas', 6000.0, 'HR', 'Manager', '2016-06-14'),
 (4, 'Rudolf', 8000.0, 'IT', 'Engineer', '2012-08-23'),
 (5, 'Suzen', 10000.0, 'Sales', 'Sales executive', '2018-02-19')]

In [43]:
# create function to update entry in sql database table

def sql_update(db):
    cur=db.cursor()
    cur.execute('update employee set name="Mohit" where id=1    ')
    db.commit()

In [44]:
sql_update(db)

In [45]:
result=cur.execute('select * from employee')
result.fetchall()

[(1, 'Mohit', 9000.0, 'HR', 'Manager', 2003),
 (2, 'Andrew', 7000.0, 'IT', 'Engineer', '2015-04-06'),
 (3, 'Thomas', 6000.0, 'HR', 'Manager', '2016-06-14'),
 (4, 'Rudolf', 8000.0, 'IT', 'Engineer', '2012-08-23'),
 (5, 'Suzen', 10000.0, 'Sales', 'Sales executive', '2018-02-19')]

In [46]:
result=cur.execute('select id,name from employee where department="HR"')
result.fetchall()

[(1, 'Mohit'), (3, 'Thomas')]

In [49]:
result=cur.execute('select min(salary) from employee where position="Engineer"')
result.fetchall()

[(7000.0,)]

In [50]:
result=cur.execute('select count(id) from employee')
result.fetchall()

[(5,)]

In [51]:
result=cur.execute('select distinct(department) from employee')
result.fetchall()

[('HR',), ('IT',), ('Sales',)]

In [52]:
result=cur.execute('select distinct(position) from employee')
result.fetchall()

[('Manager',), ('Engineer',), ('Sales executive',)]

In [57]:
result=cur.execute('select sum(salary),department from employee group by department')
result.fetchall()

[(15000.0, 'HR'), (15000.0, 'IT'), (10000.0, 'Sales')]

In [58]:
# we can also create function for sql query

def sql_query(sql):
    result=cur.execute(sql)
    return result.fetchall()

In [59]:
# call sql query through python function

sql='select id,name,position from employee'

sql_query(sql)

[(1, 'Mohit', 'Manager'),
 (2, 'Andrew', 'Engineer'),
 (3, 'Thomas', 'Manager'),
 (4, 'Rudolf', 'Engineer'),
 (5, 'Suzen', 'Sales executive')]

In [60]:
sql='select id,name,department from employee'

sql_query(sql)

[(1, 'Mohit', 'HR'),
 (2, 'Andrew', 'IT'),
 (3, 'Thomas', 'HR'),
 (4, 'Rudolf', 'IT'),
 (5, 'Suzen', 'Sales')]

In [62]:
sql='select * from employee'

sql_query(sql)

[(1, 'Mohit', 9000.0, 'HR', 'Manager', 2003),
 (2, 'Andrew', 7000.0, 'IT', 'Engineer', '2015-04-06'),
 (3, 'Thomas', 6000.0, 'HR', 'Manager', '2016-06-14'),
 (4, 'Rudolf', 8000.0, 'IT', 'Engineer', '2012-08-23'),
 (5, 'Suzen', 10000.0, 'Sales', 'Sales executive', '2018-02-19')]

# We can take bulk insert as well-    executemany

In [61]:
#executemany can be used to insert many rows once

In [64]:
entities=[(6,'Swati',10000,'Account','CA','2016-12-05' ),(7,'Ajay',50000,'Sales','Sales executive','2018-05-25'  )  ]

cur.executemany("insert into employee values (?,?,?,?,?,?)",entities)

In [65]:
sql='select * from employee'

sql_query(sql)

[(1, 'Mohit', 9000.0, 'HR', 'Manager', 2003),
 (2, 'Andrew', 7000.0, 'IT', 'Engineer', '2015-04-06'),
 (3, 'Thomas', 6000.0, 'HR', 'Manager', '2016-06-14'),
 (4, 'Rudolf', 8000.0, 'IT', 'Engineer', '2012-08-23'),
 (5, 'Suzen', 10000.0, 'Sales', 'Sales executive', '2018-02-19'),
 (6, 'Swati', 10000.0, 'Account', 'CA', '2016-12-05'),
 (7, 'Ajay', 50000.0, 'Sales', 'Sales executive', '2018-05-25')]

In [66]:
db.commit()

# Referential Integrity

In [67]:
db=sqlite3.connect('student_database.db')

In [68]:
cur=db.cursor()

In [ ]:
# create 2 tables to link with eachother- course and student1

In [69]:
cur.execute('create table course (courseid int primary key, coursename text, duration int)')

In [71]:
cur.execute('create table student1(rollno int primary key, studentname text, age int, courseid int, foreign key(courseid) references course(courseid))')

In [72]:
# put data in tables

In [81]:
cur.execute('insert into course values (78,"Data Science",11),(56,"Python",4),(101,"Data Science ",7)')

IntegrityError: UNIQUE constraint failed: course.courseid

In [79]:
result= cur.execute('select * from course')
result.fetchall()

[(78, 'Data Science', 11), (56, 'Python', 4), (101, 'Data Science', 7)]

In [75]:
cur.execute('insert into student1 values (1,"Jack",22,78),(2,"John",21,56),(3,"Rudolf",18,78),(4,"Jim",21,56)')

In [97]:
result= cur.execute('select * from student1')
result.fetchall()

[(1, 'Jack', 22, 78),
 (2, 'John', 21, 56),
 (3, 'Rudolf', 18, 78),
 (4, 'Jim', 21, 56)]

In [78]:
result= cur.execute('select courseid from course where coursename="Data Science"')
result.fetchall()

[(78,), (101,)]

In [82]:
# by mistake i have inserted data science in 2 entries in course table, sorry :(

In [83]:
result= cur.execute('select courseid from course where coursename="Python"')
result.fetchall()

[(56,)]

# SubQuery

In [86]:
result= cur.execute('select * from student1 where courseid=(select courseid from course where coursename="Python")')
result.fetchall()

[(2, 'John', 21, 56), (4, 'Jim', 21, 56)]

# Join

In [87]:
# INNER JOIN:  returns records that have matching values in both tables
# LEFT JOIN:   return all records from left table and matched record from the right table
# RIGHT JOIN:  return all records from the right table and matched records from the left table
# FULL OUTER JOIN:  returns all records where theere is a match in either left or right table

# Inner Join

In [98]:
# From STUDENT INNER JOIN course  on student.courseid=course.courseid, condition is id student courseid is present in course table then only print data
# common data from courseid column

sql='select student1.rollno, student1.studentname, course.courseid, course.coursename from student1 inner join course on student1.courseid=course.courseid'

In [99]:
result=cur.execute(sql)
result.fetchall()

[(1, 'Jack', 78, 'Data Science'),
 (2, 'John', 56, 'Python'),
 (3, 'Rudolf', 78, 'Data Science'),
 (4, 'Jim', 56, 'Python')]

# Left Join

In [100]:
# from student left join course menas,    left table is student and right is course

In [101]:
sql= ' select student1.rollno, student1.studentname, course.courseid, course.coursename from student1 left join course on student1.courseid=course.courseid'

In [102]:
result= cur.execute(sql)
result.fetchall()

[(1, 'Jack', 78, 'Data Science'),
 (2, 'John', 56, 'Python'),
 (3, 'Rudolf', 78, 'Data Science'),
 (4, 'Jim', 56, 'Python')]

In [103]:
sql= ' select student1.rollno, student1.studentname, course.courseid, course.coursename from course left join student1 on student1.courseid=course.courseid'

In [104]:
result= cur.execute(sql)
result.fetchall()

[(1, 'Jack', 78, 'Data Science'),
 (3, 'Rudolf', 78, 'Data Science'),
 (2, 'John', 56, 'Python'),
 (4, 'Jim', 56, 'Python'),
 (None, None, 101, 'Data Science')]

In [105]:
# Right Join and Full inner join not supported in sqlite3